//пытаюсь просто найти имеется ли в массиве ладья
//создание поля 8х8 (массив с 8 массивами)
let a = [["*", "*", "R", "*", "*", "*", "*", "*"], 
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
         ["*", "*", "*", "*", "*", "*", "*", "*"],
];
//x = a[0][0](не компелируется); (для себя запись)
//координата х
let x = 0; 
//координата y
let y = 0;
//создание функции, где на вход подается координата х и у массива а
const sector = (x, y) => { 
  //создание цикла, (начало цикла; пока икс меньше длинны кол-ва элементов массива а; шаг координата х+1)
for (a[x][y]; x<a.length; x++) { 
  // Если эллемент икс равен символу "R" - возвращаем i
  if (a[x] == "R") {
    let i = "в клетке " + x + y + " ладья" ;
    console.log(i);
  };
  //создаем цикл внутри цикла, который просматривает символы по координате у
  for (a[x][y]; y<a.length; y++) {
    if (a[y] == "R") {
      let i = "в клетке " + x + y + " ладья" ;
    console.log(i); 
  };
  };
};
  //если условие не выполнено и все поля без символа "R", то возвращаем "нет фигур"
  console.log("нет фигур");
};
console.log(sector(x, y));
//console.log(a[0][2]);